MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8M1AHECFC/mcu.h
        struct
        {
            __IOM uint32_t CE    : 1;  /*!< [0..0] Capture enable                                                     */
            uint32_t             : 15;
            __IOM uint32_t CPKIL : 1;  /*!< [16..16] Write 1 to this bit to perform a software reset of
                                        *   capturing.                                                                */
            uint32_t : 15;
        } CAPSR_b;
    };

    union
    {
        __IOM uint32_t CAPCR;          /*!< (@ 0x00000004) Capture Control Register                                   */

        struct
        {
            uint32_t             : 16;
            __IOM uint32_t CTNCP : 1;  /*!< [16..16] When capturing is started with this bit set to 1, capturing
                                        *   continues until the CE bit in CAPSR is cleared to 0 or
                                        *   a software reset is initiated by the CPKIL bit in CAPSR
                                        *   (see ). Continuous capture must be set before capturing
                                        *   is started.                                                               */
            uint32_t            : 3;
            __IOM uint32_t MTCM : 2;   /*!< [21..20] Specify the unit for transferring data to a bus bridge
                                        *   module.                                                                   */
            uint32_t            : 2;
            __IOM uint32_t FDRP : 8;   /*!< [31..24] Set the frame drop interval in continuous-frame capture.         */
        } CAPCR_b;
    };

    union
    {
        __IOM uint32_t CAMCR;          /*!< (@ 0x00000008) Capture interface control register                         */

        struct
        {
            __IOM uint32_t HDPOL : 1;  /*!< [0..0] Sets the polarity for detection of the horizontal sync
                                        *   signal input from an external module.                                     */
            __IOM uint32_t VDPOL : 1;  /*!< [1..1] Sets the polarity for detection of the vertical sync
                                        *   signal input from an external module.                                     */
            uint32_t             : 2;
            __IOM uint32_t JPG   : 2;  /*!< [5..4] These bits select the fetched data type.                           */
            uint32_t             : 2;
            __IOM uint32_t DTARY : 2;  /*!< [9..8] Set the input order of the luminance component and chrominance
                                        *   component.                                                                */
            uint32_t            : 2;
            __IOM uint32_t DTIF : 1;   /*!< [12..12] Sets the digital image input pins from which data is
                                        *   to be captured.                                                           */
            uint32_t              : 3;
            __IOM uint32_t FLDPOL : 1; /*!< [16..16] Sets the polarity of the field identification signal
                                        *   (FLD) from an external module.                                            */
            uint32_t            : 7;
            __IOM uint32_t DSEL : 1;   /*!< [24..24] Sets the edge for fetching the image data (D7 to D0)
                                        *   from an external module.                                                  */
            __IOM uint32_t FLDSEL : 1; /*!< [25..25] Sets the edge for capturing the field identification
                                        *   signal (FLD) from an external module.                                     */
            __IOM uint32_t HDSEL : 1;  /*!< [26..26] Sets the edge for capturing the horizontal sync signal
                                        *   (HD) from an external module.                                             */
            __IOM uint32_t VDSEL : 1;  /*!< [27..27] Sets the edge for capturing the vertical sync signal
                                        *   (VD) from an external module.                                             */
            uint32_t : 4;
        } CAMCR_b;
    };

    union
    {
        __IOM uint32_t CMCYR;          /*!< (@ 0x0000000C) Capture Interface Cycle Register                           */

        struct
        {
            __IOM uint32_t HCYL : 14;  /*!< [13..0] Horizontal Cycle Count of External Module                         */
            uint32_t            : 2;
            __IOM uint32_t VCYL : 14;  /*!< [29..16] Vertical HD Count of External Module                             */
            uint32_t            : 2;
        } CMCYR_b;
    };

    union
    {
        __IOM uint32_t CAMOR;          /*!< (@ 0x00000010) Capture Interface Offset Register                          */

        struct
        {
            __IOM uint32_t HOFST : 13; /*!< [12..0] Specify the capture start location in terms of the number
                                        *   of clock cycles from a horizontal sync signal (1-cycle
                                        *   units).                                                                   */
            uint32_t             : 3;
            __IOM uint32_t VOFST : 12; /*!< [27..16] Specify the capture start location in terms of the
                                        *   HD count from a vertical sync signal (1-HD units).                        */
            uint32_t : 4;
        } CAMOR_b;
    };

    union
    {
        __IOM uint32_t CAPWR;          /*!< (@ 0x00000014) Capture Interface Width Register                           */

        struct
        {
            __IOM uint32_t HWDTH : 13; /*!< [12..0] Specify the horizontal capture period.                            */
            uint32_t             : 3;
            __IOM uint32_t VWDTH : 12; /*!< [27..16] Specify the vertical capture period (4-HD units).                */
            uint32_t             : 4;
        } CAPWR_b;
    };

    union
    {
        __IOM uint32_t CAIFR;          /*!< (@ 0x00000018) Capture Interface Input Format Register                    */

        struct
        {
            __IOM uint32_t FCI : 2;    /*!< [1..0] Set the timing to start capturing.                                 */
            uint32_t           : 2;
            __IOM uint32_t CIM : 1;    /*!< [4..4] Sets the images to be captured.                                    */
            uint32_t           : 3;
            __IOM uint32_t IFS : 1;    /*!< [8..8] Sets the input mode for capturing images.                          */
            uint32_t           : 23;
        } CAIFR_b;
    };
    __IM uint32_t RESERVED[3];

    union
    {
        __IOM uint32_t CRCNTR;         /*!< (@ 0x00000028) CEU Register Control Register                              */

        struct
        {
            __IOM uint32_t RC : 1;     /*!< [0..0] Specifies switching of the register plane used by the
                                        *   CEU in synchronization with VD.                                           */
            __IOM uint32_t RS : 1;     /*!< [1..1] Specifies which register plane is used by the CEU in
                                        *   synchronization with VD.                                                  */
            uint32_t           : 2;
            __IOM uint32_t RVS : 1;    /*!< [4..4] Sets the timing to switch the register plane in both-field
                                        *   capture.                                                                  */
            uint32_t : 27;
        } CRCNTR_b;
    };

    union
    {
        __IOM uint32_t CRCMPR;         /*!< (@ 0x0000002C) CEU Register Forcible Control Register                     */

        struct
        {
            __IOM uint32_t RA : 1;     /*!< [0..0] Indicates the register plane currently specified.                  */
            uint32_t          : 31;
        } CRCMPR_b;
    };

    union
    {
        __IOM uint32_t CFLCR;          /*!< (@ 0x00000030) Capture Filter Control Register                            */

        struct
        {
            __IOM uint32_t HFRAC : 12; /*!< [11..0] Fraction Part of Horizontal Scale-Down Factor                     */
            __IOM uint32_t HMANT : 4;  /*!< [15..12] Mantissa Part of Horizontal Scale-Down Factor                    */
            __IOM uint32_t VFRAC : 12; /*!< [27..16] Fraction Part of Vertical Scale-Down Factor                      */
            __IOM uint32_t VMANT : 4;  /*!< [31..28] Mantissa Part of Vertical Scale-Down Factor                      */
        } CFLCR_b;
    };

    union
    {
        __IOM uint32_t CFSZR;          /*!< (@ 0x00000034) Capture Filter Size Clip Register                          */

        struct
        {
            __IOM uint32_t HFCLP : 12; /*!< [11..0] Specify the horizontal clipping value of the filter
                                        *   output size (4-pixel units).                                              */
            uint32_t             : 4;
            __IOM uint32_t VFCLP : 12; /*!< [27..16] Set the vertical clipping value of the filter output
                                        *   size (4-pixel units).                                                     */
            uint32_t : 4;
        } CFSZR_b;
    };

    union
    {
        __IOM uint32_t CDWDR;          /*!< (@ 0x00000038) Capture Destination Width Register                         */

        struct
        {
            __IOM uint32_t CHDW : 13;  /*!< [12..0] Specify the horizontal image size in the memory area
                                        *   where the captured image is to be stored (4-byte units).                  */
            uint32_t : 19;
        } CDWDR_b;
    };

    union
    {
        __IOM uint32_t CDAYR;          /*!< (@ 0x0000003C) Capture Data Address Y Register                            */

        struct
        {
            __IOM uint32_t CAYR : 32;  /*!< [31..0] Capture Data Address Y                                            */
        } CDAYR_b;
    };

    union
    {
        __IOM uint32_t CDACR;          /*!< (@ 0x00000040) Capture Data Address C Register                            */

        struct
        {
            __IOM uint32_t CACR : 32;  /*!< [31..0] Capture Data Address C                                            */
        } CDACR_b;
    };

    union
    {
        __IOM uint32_t CDBYR;          /*!< (@ 0x00000044) Capture Data Bottom-Field Address Y Register               */

        struct
        {
            __IOM uint32_t CBYR : 32;  /*!< [31..0] Set the address for storing the Y (luminance) component
                                        *   data of the captured bottom-field data (4-pixel units).                   */
        } CDBYR_b;
    };

    union
    {
        __IOM uint32_t CDBCR;          /*!< (@ 0x00000048) Capture Data Bottom-Field Address C Register               */

        struct
        {
            __IOM uint32_t CBCR : 32;  /*!< [31..0] Set the address for storing the C (chrominance) component
                                        *   data of the captured bottom-field data (4-pixel units).                   */
        } CDBCR_b;
    };

    union
    {
        __IOM uint32_t CBDSR;          /*!< (@ 0x0000004C) Capture Bundle Destination Size Register                   */

        struct
        {
            __IOM uint32_t CBVS : 23;  /*!< [22..0] Select the number of lines or number of bytes for output
                                        *   to the memory in a bundle write.                                          */
            uint32_t : 9;
        } CBDSR_b;
    };
    __IM uint32_t RESERVED1[3];

    union
    {
        __IOM uint32_t CFWCR;          /*!< (@ 0x0000005C) Firewall Operation Control Register                        */

        struct
        {
            __IOM uint32_t FWE : 1;    /*!< [0..0] With the setting of FWE = 1, when an address exceeds
                                        *   the value set with FWV, the address is retained and an
                                        *   interrupt source FWF is set. After this, the address is
                                        *   not incremented and data is overwritten on the upper limit
                                        *   address.                                                                  */
            uint32_t           : 4;
            __IOM uint32_t FWV : 27;   /*!< [31..5] Specify the upper limit of a write address.                       */
        } CFWCR_b;
    };

    union
    {
        __IOM uint32_t CLFCR;          /*!< (@ 0x00000060) Capture Low-Pass Filter Control Register                   */

        struct
        {
            __IOM uint32_t LPF : 1;    /*!< [0..0] Enables or disables operation of the low-pass filter.              */
            uint32_t           : 31;
        } CLFCR_b;
    };

    union
    {
        __IOM uint32_t CDOCR;          /*!< (@ 0x00000064) Capture Data Output Control Register                       */

        struct
        {
            __IOM uint32_t COBS : 1;   /*!< [0..0] Controls swapping in 8-bit units for data output from
                                        *   the CEU.                                                                  */
            __IOM uint32_t COWS : 1;   /*!< [1..1] Controls swapping in 16-bit units for data output from
                                        *   the CEU.                                                                  */
            __IOM uint32_t COLS : 1;   /*!< [2..2] Controls swapping in 32-bit units for data output from
                                        *   the CEU.                                                                  */
            uint32_t           : 1;
            __IOM uint32_t CDS : 1;    /*!< [4..4] Sets the image format when outputting the image data
                                        *   captured in the YCbCr422 format to the memory.                            */
            uint32_t           : 11;
            __IOM uint32_t CBE : 1;    /*!< [16..16] Controls the number of lines of captured data to be
                                        *   written to the memory.                                                    */
            uint32_t : 15;
        } CDOCR_b;
    };
    __IM uint32_t RESERVED2[2];

    union
    {
        __IOM uint32_t CEIER;           /*!< (@ 0x00000070) Capture Event Interrupt Enable Register                    */

        struct
        {
            __IOM uint32_t CPEIE   : 1; /*!< [0..0] One-Frame Capture End Interrupt Enable                             */
            __IOM uint32_t CFEIE   : 1; /*!< [1..1] CFE Interrupt Enable                                               */
            uint32_t               : 2;
            __IOM uint32_t IGRWIE  : 1; /*!< [4..4] Register-Access-During-Capture Interrupt Enable                    */
            uint32_t               : 3;
            __IOM uint32_t HDIE    : 1; /*!< [8..8] HD Interrupt Enable                                                */
            __IOM uint32_t VDIE    : 1; /*!< [9..9] VD Interrupt Enable                                                */
            uint32_t               : 2;
            __IOM uint32_t CPBE1IE : 1; /*!< [12..12] CPBE1 Interrupt Enable                                           */
            __IOM uint32_t CPBE2IE : 1; /*!< [13..13] CPBE2 Interrupt Enable                                           */
            __IOM uint32_t CPBE3IE : 1; /*!< [14..14] CPBE3 Interrupt Enable                                           */
            __IOM uint32_t CPBE4IE : 1; /*!< [15..15] CPBE4 Interrupt Enable                                           */
            __IOM uint32_t CDTOFIE : 1; /*!< [16..16] CDTOF Interrupt Enable                                           */
            __IOM uint32_t IGHSIE  : 1; /*!< [17..17] IGHS Interrupt Enable                                            */
            __IOM uint32_t IGVSIE  : 1; /*!< [18..18] IGVS Interrupt Enable                                            */
            uint32_t               : 1;
            __IOM uint32_t VBPIE   : 1; /*!< [20..20] VBP Interrupt Enable                                             */
            uint32_t               : 2;
            __IOM uint32_t FWFIE   : 1; /*!< [23..23] FWF Interrupt Enable                                             */
            __IOM uint32_t NHDIE   : 1; /*!< [24..24] Non-HD Interrupt Enable                                          */
            __IOM uint32_t NVDIE   : 1; /*!< [25..25] Non-VD Interrupt Enable                                          */
            uint32_t               : 6;
        } CEIER_b;
    };

    union
    {
        __IOM uint32_t CETCR;          /*!< (@ 0x00000074) Capture Event Flag Clear Register                          */

        struct
        {
            __IOM uint32_t CPE : 1;    /*!< [0..0] An interrupt indicating that capturing of one frame from
                                        *   an external module has finished.                                          */
            __IOM uint32_t CFE : 1;    /*!< [1..1] An interrupt indicating that capturing of one field from
                                        *   an external module has finished.                                          */
            uint32_t            : 2;
            __IOM uint32_t IGRW : 1;   /*!< [4..4] An interrupt indicating that during capturing, access
                                        *   was attempted to a register to which writing during operation
                                        *   is prohibited.                                                            */
            uint32_t          : 3;
            __IOM uint32_t HD : 1;     /*!< [8..8] An interrupt indicating that HD (horizontal sync signal)
                                        *   was input from an external module.                                        */
            __IOM uint32_t VD : 1;     /*!< [9..9] An interrupt indicating that VD (vertical sync signal)
                                        *   was input from an external module.                                        */
            uint32_t             : 2;
            __IOM uint32_t CPBE1 : 1;  /*!< [12..12] An interrupt indicating that writing to CDAYR and CDACR
                                        *   in a bundle write has finished.                                           */
            __IOM uint32_t CPBE2 : 1;  /*!< [13..13] An interrupt indicating that writing to CDAYR2 and
                                        *   CDACR2 in a bundle write has finished.                                    */
            __IOM uint32_t CPBE3 : 1;  /*!< [14..14] An interrupt indicating that writing to CDBYR and CDBCR
                                        *   in a bundle write has finished.                                           */
            __IOM uint32_t CPBE4 : 1;  /*!< [15..15] An interrupt indicating that writing to CDBYR2 and
                                        *   CDBCR2 in a bundle write has finished.                                    */
            __IOM uint32_t CDTOF : 1;  /*!< [16..16] An interrupt indicating that data overflowed in the
                                        *   CRAM of the write buffer                                                  */
            __IOM uint32_t IGHS : 1;   /*!< [17..17] An interrupt generated when the number of HD cycles
                                        *   set in CMCYR differ from the number of HD cycles input
                                        *   from an external module.                                                  */
            __IOM uint32_t IGVS : 1;   /*!< [18..18] An interrupt generated when the number of VD cycles
                                        *   set in CMCYR differ from the number of VD cycles input
                                        *   from an external module.                                                  */
            uint32_t           : 1;
            __IOM uint32_t VBP : 1;    /*!< [20..20] An interrupt indicating that VD has been input while
                                        *   the CEU holds data (insufficient vertical-sync front porch).              */
            uint32_t           : 2;
            __IOM uint32_t FWF : 1;    /*!< [23..23] The interrupt is generated when data is written to
                                        *   the address that exceeds the value specified with CFWCR.FMV.              */
            __IOM uint32_t NHD : 1;    /*!< [24..24] An interrupt indicating that no HD was input.                    */
            __IOM uint32_t NVD : 1;    /*!< [25..25] An interrupt indicating that no VD was input.                    */
            uint32_t           : 6;
        } CETCR_b;
    };
    __IM uint32_t RESERVED3;

    union
    {
        __IM uint32_t CSTSR;           /*!< (@ 0x0000007C) Capture Status Register                                    */

        struct
        {
            __IM uint32_t CPTON : 1;   /*!< [0..0] Indicates that the CEU is operating.                               */
            uint32_t            : 15;
            __IM uint32_t CPFLD : 1;   /*!< [16..16] Indicates which field is being captured.                         */
            uint32_t            : 7;
            __IM uint32_t CRST  : 1;   /*!< [24..24] Indicates which register plane is currently used.                */
            uint32_t            : 7;
        } CSTSR_b;
    };
    __IM uint32_t RESERVED4;

    union
    {
        __IM uint32_t CDSSR;           /*!< (@ 0x00000084) Capture Data Size Register                                 */

        struct
        {
            __IM uint32_t CDSS : 32;   /*!< [31..0] Indicate the size of data written to the memory in data
                                        *   enable fetch.                                                             */
        } CDSSR_b;
    };
    __IM uint32_t RESERVED5[2];

    union
    {
        __IOM uint32_t CDAYR2;         /*!< (@ 0x00000090) Capture Data Address Y Register 2                          */

        struct
        {
            __IOM uint32_t CAYR2 : 32; /*!< [31..0] Capture Data Address Y                                            */
        } CDAYR2_b;
    };

    union
    {
        __IOM uint32_t CDACR2;         /*!< (@ 0x00000094) Capture Data Address C Register 2                          */

        struct
        {
            __IOM uint32_t CACR2 : 32; /*!< [31..0] Capture Data Address C2                                           */
        } CDACR2_b;
    };

    union
    {
        __IOM uint32_t CDBYR2;         /*!< (@ 0x00000098) Capture Data Bottom-Field Address Y Register
                                        *                  2                                                          */

        struct
        {
            __IOM uint32_t CBYR2 : 32; /*!< [31..0] Set the address for storing the Y component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBYR2_b;
    };

    union
    {
        __IOM uint32_t CDBCR2;         /*!< (@ 0x0000009C) Capture Data Bottom-Field Address C Register
                                        *                  2                                                          */

        struct
        {
            __IOM uint32_t CBCR2 : 32; /*!< [31..0] Set the address for storing the C component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBCR2_b;
    };

    union
    {
        __IOM uint32_t AXIBUSCTL2;      /*!< (@ 0x000000A0) AXI Bus Control Register 2                                 */

